def matrixChecker(mat):
    #Если определитель равен нулю, то у него есть столбец, который является линейной комбинацией остальных столбцов
    determinant = mat[0][0] * mat[1][1] * mat[2][2] + mat[0][1] * mat[1][2] * mat[2][0] + mat[0][2] * mat[1][0] * mat[2][1] \
        - mat[0][2] * mat[1][1] * mat[2][0] - mat[0][0] * mat[1][2] * mat[2][1] - mat[0][1] * mat[1][0] * mat[2][2]
    
    if determinant == 0:
        print("Столбцы линейно зависимы", mat)
    else:
        print("Столбцы линейно независимы", mat)



mat = [[10, 20, 30], [40, 50, 60], [70, 80, 90]]

matrixChecker(mat)