n = int(input("Введите число N: "))

#Создание двумерного списка под треугольник
a = [[" "] * ((2 ** n) - 1) for i in range(2 ** (n - 1))]

#Вставляем первую звездочку
a[0][((2 ** n) // 2) - 1] = "*"

#Задаем координаты левой верхней и правой нижней звездочки треугольника на текущем шаге
x1 = ((2 ** n) // 2) - 1
y1 = 0

x2 = ((2 ** n) // 2) - 1
y2 = 0

#Создание треугольника 
for k in range(1, n):
    for i in range(y1, y2 + 1):
        for j in range(x1, x2 + 1):
            a[i + (2 ** (k - 1))][j - (2 ** (k - 1))] = a[i][j]
            a[i + (2 ** (k - 1))][j + (2 ** (k - 1))] = a[i][j]
    x1 -= 2 ** (k - 1)
    x2 += 2 ** (k - 1)
    y2 = ((y2 + 1) * 2) - 1

#Вывод
for i in range(2 ** (n - 1)):
    for j in range((2 ** n) - 1):
        print(a[i][j], end = "")
    print()